package HomeWork;

/*Перевірте, чи є число записане в змінну n натуральне число - простим. Постарайтеся не виконувати зайвих дій (наприклад, після того, 
 * як ви знайшли хоча б один нетривіальний дільник вже ясно, що число складене і перевірку продовжувати не потрібно). 
 * Також врахуйте, що найменший дільник натурального числа n, якщо він взагалі є, обов'язково розташовується в відрізку [2; √n]. 
 */
public class Loops9 {

	public static void main(String[] args) {
		System.out.println(natural(15));

	}

	static String natural(int x) {
		int i;
		String n = "Число є простим";
		for (i = 2; i <= Math.sqrt(x); i++) {
			if ((x % i == 0)) {
				n = "Число не є простим";
				i = x;
			}
		}
		return n;

	}
}
